In [3]:
# import the pandas library
import pandas as pd
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
                 'Age': [24, 23, 22, 19, 10]}
data

{'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'Age': [24, 23, 22, 19, 10]}

In [4]:
# Calling the pandas data frame method by passing the dictionary (data) as a parameter
df = pd.DataFrame(data)
df

In [5]:
df

      Name  Age
0   Ashika   24
1     Tanu   23
2   Ashwin   22
3    Mohit   19
4  Sourabh   10

In [6]:
df[['Age']]

   Age
0   24
1   23
2   22
3   19
4   10

In [7]:
df[['Name']]

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

In [8]:
print(type(df[['Name']]))

<class 'pandas.core.frame.DataFrame'>

In [9]:
row = df.loc[4]

In [10]:
row

Name    Sourabh
Age          10
Name: 4, dtype: object

In [11]:
               del df['Age']

In [12]:
df

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

In [13]:
import pandas as pd
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'Age': [24, 23, 22, 19, 10]}
data

{'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'Age': [24, 23, 22, 19, 10]}

In [14]:
df = pd.DataFrame(data)
df.insert(2, 'name', df['Name'])

In [15]:
df

      Name  Age     name
0   Ashika   24   Ashika
1     Tanu   23     Tanu
2   Ashwin   22   Ashwin
3    Mohit   19    Mohit
4  Sourabh   10  Sourabh